[{"company_name": "Micron Technology", "company_abbreviation": "microntec", "title": "Strategic Program Manager", "description": "Our vision is to transform how the world uses information to enrich life for all.Join an inclusive team passionate about one thing: using their expertise in the relentless pursuit of innovation for customers and partners. The solutions we build help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can fuel the very innovation we are pursuing.Main Responsibilities:Spearhead initiatives that strive to build a strong and diverse talent pipeline.Craft and implement strategies that attract talent from various backgrounds, encouraging an inclusive workforce.Design and implement programs to build technician hiring pipelineTo ensure a continuous talent pipeline, you will collaborate with educational institutions and government agencies to develop career skills and provide opportunities for upskilling and reskilling talent. Your ability to build strong partnerships and identify mutually beneficial opportunities will be key in this aspect of your role.Translate global strategies into localized programs that improve the scale, quality and diversity of our talent pipeline – expertise and innovative thinking will be important in ensuring that our recruitment initiatives align with our overarching business goalsCollaborate with business leaders, HR Business Partners, and other team members to ensure hiring needs are in line with global strategies. Building positive relationships and maintaining effective communication will be vital to the success of talent acquisition programs.Build and implement inventive programs that engage, pipeline, and attract outstanding talent through non-traditional pathways, attracting talent through unconventional routes.Partner with colleges and institutions to specialize education crafted to develop specific career skills, focusing on diverse emerging talent and shortening the pathway into employment.Partner with government agencies and explore new opportunities to upskill and reskill talent to enable employability.Other Responsibilities:Create and lead initiatives specifically focused on identifying, engaging, attracting, and hiring talent from diverse and unconventional backgrounds. Your creativity and resourcefulness will be instrumental in building a diverse and inclusive workforce.As part of our commitment to fostering inclusivity, you will be responsible for developing and implementing inventive talent sourcing methods. Your capacity to think creatively and harness a range of platforms and channels will be integral in attracting a diverse array of candidates.Actively participating in social media and networking events, you will establish connections with potential candidates and promote Micron as an attractive employer. Your knowledge in using these platforms will help us expand our talent pool and attract highly skilled individuals to join our organization.As an advocate for inclusive hiring practices, you will integrate diversity, equity, and inclusion (DEI) principles into all aspects of our recruitment process. Your commitment to ensuring equal opportunities for all candidates will contribute to the creation of a diverse and inclusive workforce.To measure the effectiveness of our talent acquisition programs, you will provide data, metrics, and reporting to our partners. By analyzing and presenting this information, you will help inform strategic decisions and drive continuous improvement.Candidate Profile:As the ideal candidate for this role, you should hold a bachelor's degree and have a proven experience in program/process management within the HR/Talent Acquisition field. Your proven track record in leading successful programs will be highly valued.Extensive knowledge of recruitment processes, technologies, and recruitment marketing is important for excelling in this position. Your proficiency in using these tools and strategies will empower you to optimally drive talent acquisition initiatives.Strong relationship-building, communication, and agility skills are important in this role. You should be able to optimally collaborate with individuals at all levels of the organization and adapt to changing priorities and dynamics.Experience in regional/global or cross-cultural project management will be advantageous in this role. Your ability to navigate and efficiently implement programs in diverse cultural contexts will contribute to our global talent acquisition efforts.Experience in talent attraction and acquisition, especially non-traditional talent sourcing, is highly advantageous. Being able to think creatively and tap into non-traditional talent pools will give you an edge in this position.About Micron Technology, Inc.We are an industry leader in innovative memory and storage solutions transforming how the world uses information to enrich life for all. With a relentless focus on our customers, technology leadership, and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND, and NOR memory and storage products through our Micron® and Crucial® brands. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence and 5G applications that unleash opportunities — from the data center to the intelligent edge and across the client and mobile user experience.To learn more, please visit micron.com/careersAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.To request assistance with the application process and/or for reasonable accommodations, please contact hrsupport_sg@micron.comMicron Prohibits the use of child labor and complies with all applicable laws, rules, regulations, and other international and industry labor standards.Micron does not charge candidates any recruitment fees or unlawfully collect any other payment from candidates as consideration for their employment with Micron.", "internal_id": "micron_JR76170", "location": "Fab 10N/X, Singapore", "remote_type": "Onsite", "country": "Singapore", "posted_date": "2025-03-29", "url": "https://micron.wd1.myworkdayjobs.com/External/job/Fab-10NX-Singapore/Strategic-Program-Manager_JR76170", "search_term": "Artificial Intelligence", "search_terms": ["Artificial Intelligence"]}, {"company_name": "Micron Technology", "company_abbreviation": "microntec", "title": "SEM Technician", "description": "Our vision is to transform how the world uses information to enrich life for all.Join an inclusive team passionate about one thing: using their expertise in the relentless pursuit of innovation for customers and partners. The solutions we build help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can fuel the very innovation we are pursuing.Micron's vision is to transform how the world uses information to enrich life for all. As a global leader in memory and storage solutions, we are at the forefront of innovation, driving technological advancements that accelerate progress across industries. Our mission is to lead with integrity, innovation, and excellence, empowering our team members to craft the future of memory technology.As a SEM technician in YE lab under TD (Technology Development) at Micron’s Singapore site, you will focus on the operation and minor maintenance of SEMs, sample preparation for SEM that includes safe operation of the acid hood, sputter coaters, ion millers, UV cleaners, etchers, micro-cleaving tools, and optical microscopes.  Perform construction analysis using SEM with a strong attention to detail. Successful candidates for this position will be placed at corresponding technician level based on previous experience and education.In this role, your responsibilities will include, but are not limited to the following:Provide SEM support for various technology nodes of NAND development.Interact with process/integration engineers regarding requests, priorities, and/or general communications.Communicate with Micron team members and supplier representatives at all levels regarding tool issues, requests, support items, etc.Troubleshoot tool issues and optimize tool performance.Qualified candidates for this position will have:Associate degree or equivalent experience in Engineering or a related field.Good understanding of FAB process steps: wet etch, dry etch, PVD, ALD, CMP, etc.Ability to prioritize and work independently.Excellent communication skills (written, verbal and presentation).Ability to analyze problems and provide resolutions.PC skills to include M.S. Office (PowerPoint, Word, Excel, OneNote).Willing to work any shift on a rotating scheduleAt Micron, your personal well-being and professional growth are our priorities. We offer a comprehensive benefits package designed to support your health, provide peace of mind, and help you plan for the future. Our benefits include:Competitive medical, dental, and vision plans.Income protection through disability and paid family leave programs.Generous paid time off and holidays.Opportunities for career advancement and professional development.Employee stock purchase plan (ESPP).For additional information regarding the Benefit programs available, please see the Benefits Guide posted on micron.com/careers/benefits.About Micron Technology, Inc.We are an industry leader in innovative memory and storage solutions transforming how the world uses information to enrich life for all. With a relentless focus on our customers, technology leadership, and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND, and NOR memory and storage products through our Micron® and Crucial® brands. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence and 5G applications that unleash opportunities — from the data center to the intelligent edge and across the client and mobile user experience.To learn more, please visit micron.com/careersAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.To request assistance with the application process and/or for reasonable accommodations, please contact hrsupport_sg@micron.comMicron Prohibits the use of child labor and complies with all applicable laws, rules, regulations, and other international and industry labor standards.Micron does not charge candidates any recruitment fees or unlawfully collect any other payment from candidates as consideration for their employment with Micron.", "internal_id": "micron_JR72750", "location": "Fab 10N/X, Singapore", "remote_type": "Onsite", "country": "Singapore", "posted_date": "2025-03-29", "url": "https://micron.wd1.myworkdayjobs.com/External/job/Fab-10NX-Singapore/SEM-Technician_JR72750", "search_term": "Artificial Intelligence", "search_terms": ["Artificial Intelligence"]}]